feat: improve README.md
